[
  {
  "id": 1,
  "date": "Posted on 19 September 2020",
  "type": "Lifestyle",
  "title": "What is CrossFit?",
  "subtitle": "CrossFit is a lifestyle characterized by safe, effective exercise and sound nutrition.",
  "cover": "https://images.unsplash.com/photo-1541534741688-6078c6bfb5c5?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=300&q=80",
  "paragraph": "<div class='mt-2'> <p class='article-color'>CrossFit is a lifestyle characterized by safe, effective exercise and sound nutrition. CrossFit can be used to accomplish any goal, from improved health to weight loss to better performance. The program works for everyone — people who are just starting out and people who have trained for years. </p><h3>THE WORKOUTS</h3> <p class='article-color'> The magic is in the movement. CrossFit workouts are different every day and can be modified to help each athlete achieve their goals. The workouts may be adapted for people at any age and level of fitness. </p><figure> <img src='https://images.unsplash.com/photo-1519311965067-36d3e5f33d39?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=300&q=80' alt='image' class='imaged img-fluid'> </figure> <h3>THE LIFESTYLE</h3> <p class='article-color'> Off the carbs, off the couch. The CrossFit lifestyle — a combination of sound nutrition and exercise — is the key to fitness and long-term health. </p><figure> <img src='https://images.unsplash.com/photo-1490645935967-10de6ba17061?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=300&q=80' alt='image' class='imaged img-fluid'> </figure> <h3>CONSTANT VARIATION</h3> <p class='article-color'> Different every day, CrossFit workouts are tailored to the individual. </p><h3>FUNCTIONAL MOVEMENTS</h3> <p class='article-color'> CrossFit uses safe, effective, and efficient movements similar to those you use every day in life. </p><h3>HIGH INTENSITY</h3> <p class='article-color'> In CrossFit workouts, intensity levels are adjusted to challenge the individual and safely improve fitness. </p> <hr> <h3>Is CrossFit for me?</h3> <p class='article-color'> Yes. Everyone can do CrossFit regardless of age, injuries and current fitness levels. The program is modified for each person to help him or her safely become healthier and fitter. Grandparents and Olympians can perform modified versions of the same general workout. </p><h3>Do I need to be in shape to start CrossFit?</h3> <p class='article-color'> No. CrossFit is the program that will get you in shape. No matter what your current fitness level is, you can start CrossFit. As you become fitter, workouts will become more challenging. Every workout is designed to help you succeed, improve fitness and move you toward your goals. </p><h3>Is CrossFit safe?</h3> <p class='article-color'> Yes. CrossFit training is very safe, and sitting on your couch is actually incredibly dangerous. In CrossFit boxes, credentialed trainers provide precise instructions and coaching to help people move safely and efficiently, helping people avoid all the diseases that come from inactivity, obesity and poor nutrition. </p><h3>What about nutrition?</h3> <p class='article-color'> To accomplish your goals faster, we recommend you eat a variety of healthy foods in quantities that support fitness training but not body fat. By avoiding excessive amounts of refined carbohydrates and measuring your intake of protein, carbohydrates and fat, you will see dramatic, measurable increases in health. </p><h3>How will CrossFit affect my health?</h3> <p class='article-color'> CrossFit holds a uniquely elegant solution to the greatest problem facing the world today: chronic disease. The CrossFit program—constantly varied high-intensity functional movement coupled with meat and vegetables, nuts and seeds, some fruit, little starch, and no sugar—can give you a pass on chronic disease. If you are not sick, know that fitness provides a great margin of protection against the ravages of time and disease. Fitness is and should be “super-wellness.” To improve or preserve your health, do CrossFit. </p> </div>",
  "url": ""
  },
  {
  "id": 2,
  "date": "Posted on 12 October 2020",
  "type": "Lifestyle",
  "title": "What Are the Benefits of CrossFit and Is It Safe?",
  "subtitle": "CrossFit gyms, known as “boxes,” are popping up around the world as it grows in popularity.",
  "cover": "https://images.unsplash.com/photo-1598136490941-30d885318abd?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=300&q=80",
  "paragraph": "<div class='mt-2'> <p class='article-color'>CrossFit gyms, known as “boxes,” are popping up around the world as it grows in popularity. So, what is CrossFit and what are the health benefits and risks?CrossFit is a form of high-intensity power fitness (HIPT). A CrossFit workout may include dynamic exercises like: plyometric jumping Olympic weightlifting kettlebells explosive bodyweight movementsRead on to learn about the benefits of CrossFit and whether it’s right for you. </p><h3>1. May improve physical strength </h3> <p class='article-color'> The high-intensity, multi-joint movements in CrossFit may help you gain muscle strength and stamina. Adding additional weight to your workouts can further increase muscle gain by adding stress to your muscles.You can also continuously challenge your muscles by participating in the workout of the day, which will give your muscles some variety. The workout of the day, or WOD, is a signature part of the CrossFit program. Each day, a new set of exercises is posted. The goal is then to complete as many repetitions of each exercise as possible in a set period of time. </p><h3>2. May help you improve aerobic fitness </h3> <p class='article-color'> CrossFit’s high-intensity power training (HIPT). This type of training may help to increase VO2 max, or the maximum amount of oxygen you can utilize during exercise.However, research has been inconclusive on both the short- and long-term effects of CrossFit on physiological changes and aerobic benefits. More research is needed to understand how CrossFit improves aerobic fitness compared to other forms of exercise. </p><h3>3. Improve agility, balance, and flexibility </h3> <p class='article-color'> CrossFit workouts often include functional exercises, or exercises that mimic movements you do in everyday life. Functional movements, such as squats, kettlebell swings, or overhead presses, can help improve agility, balance, and flexibility.They also can reduce your risk for injury and improve your quality of life as you age. </p><h3>4. Burn calories and manage weight</h3> <p class='article-color'> CrossFit workouts may help you burn more calories than other workouts. On average, a 195-pound male or 165-pound female will burn 15 to 18 calories per minute and 13 to 15 calories per minute, respectively, during a CrossFit circuit. You may also continue to burn calories during the recovery period.That’s compared to 11 calories per minute and 9 calories per minute during traditional weightlifting using machines.If your goal is weight loss, try following a healthy diet in addition to following a CrossFit exercise regimen. </p><h3>Is CrossFit safe?</h3> <p class='article-color'> CrossFit is a high-intensity form of exercise. Your risk for injuries increases anytime you increase the intensity of your workouts or the amount of weight you’re lifting.Some common CrossFit injuries include: low back pain rotator cuff tendonitis Achilles tendonitis knee injuries tennis elbowIf you’re new to CrossFit, it’s a smart idea to work with a trained fitness professional that can make sure you’re doing the exercises properly. Having improper form, trying to move through exercises too quickly, or lifting more than you can handle can all lead to injury.Beginners should go at a slower pace and increase weight gradually until your fitness level improves.CrossFit isn’t safe for everyone. If you’re pregnant and already practicing CrossFit, it may be fine to continue, but make sure to talk to your doctor first. If you’re pregnant and new to CrossFit, you should wait until after your pregnancy to start.CrossFit isn’t safe if you’re injured or have other serious health concerns, either. Make sure you get cleared by your doctor first or work with a physical therapist before starting CrossFit.If you’re over age 65 and already physically fit, CrossFit may or may not be safe for you to try. Talk to your doctor before starting. </p></div>",
  "url": ""
  }
]