[
  {
  "id": 1,
  "date": "Posted on 20 October 2020",
  "type": "Nutrition",
  "title": "The Best Foods for functional trainingters",
  "subtitle": "These foods get your body functioning in an optimal",
  "cover": "https://images.unsplash.com/photo-1497888329096-51c27beff665?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=300&q=80",
  "paragraph": "<div class='mt-2'> <p class='article-color'>These foods get your body functioning in an optimal, supercharged state that will have you flippin’ tires in no time! Check ‘em out and then keep reading to see what to avoid.1 Lentil“functional trainingters need to keep their protein intake around 30 percent of their daily calories—and lentils add a whopping nine grams per half-cup to your meal, with loads of fiber. </p><h3> 2 Banana and Whey Protein Smoothie </h3> <p class='article-color'>“Post-workout, you need to fuel and optimize recovery by replenishing glycogen stores and protein for tissue repair. Your body craves both fast-absorbing carbohydrates, like those in fruits and berries, and protein that's quick and easy to absorb like whey,” comments Lisa Hayim, registered dietitian and founder of The WellNecessities. Just make sure your whey protein powder is clean and not a laundry list of ingredients and additives. For some smoothie inspiration, check out the 23 Best Protein Shake Recipes for Weight Loss! </p><h3>3 Coconut Oil </h3> <p class='article-color'>You might have splurged on a tub of the stuff for shinier hair and smoother skin, but slipping it into your diet is a functional trainingter’s definite must-do: “Coconut oil is an excellent fuel source for workouts. Although it’s saturated fat, the medium-chain fatty acids make it easily absorbable by the small intestine (not requiring the full digestive process),” “This means it provides increased energy faster than any other fat. The fats are converted by the liver into an immediate energy source, much like it would carbohydrates, but it’s sugar and carbohydrate-free! Try a tablespoon of it before your workouts and you’ll be amazed at the energy and endurance it provides.” </p><h3>4 Nuts and Seeds </h3> <p class='article-color'>Get svelte eating like a bird? You betcha. “Nuts and seeds are packed with nutrients and omega-3 fatty acids, which will fuel your recovery after an intense functional training WOD. </p><h3>5 Sweet Potatoes</h3> <p class='article-color'>The neverending Instagram stream of this tuberous veggie might have calmed down after the fall, but there’s still plenty of reason to reach for this nutrition powerhouse: “Your body needs functional carbs for a boost of energy. Glycogen is stored in your muscles (and liver) through the digestion of carbs, and your body relies on muscles’ glycogen for energy to carry you through your workout,” explains Kotsopoulos. “One of the best ways to fuel this is with sweet potatoes since they’re complex carbs that are slow- releasing and thus will sustain you through your workout. Sweet potatoes help to balance blood sugar levels providing consistent, steady energy levels. They’re also rich in B6, which combat the physical effects of stress the body goes through during a functional training session, and rich in antioxidants Vitamin C and beta-carotene, [which helps to repair] free radical damage caused by working out.” </p><h3>6 Banana and Peanut Butter</h3> <p class='article-color'>Not quite in the mood to head to Smoothie-Ville? It’s okay. This nutrient-dense snack proves a boon for functional trainingters: “If you do functional training, your perfect snack is going to be a blend of carbohydrates, protein and a limited amount of healthy fat,” says Hayim. “The banana here is most important, as it is an excellent source of potassium, which is needed to help the heart and skeletal muscles flex and contract during your workout.” </p><h3>7 Eggs</h3> <p class='article-color'>“Packed with protein, B vitamins, and good fats, eggs are a superfood for functional trainingters. An egg provides about 7 to 10 grams of protein. Starting the day with a few eggs ups your protein budget daily,” says Dr. Taz. To make breakfast even more protein-rich, try mixing things up and pairing it with one of these Surprising High-Protein Foods for Weight Loss. </p><h3>8 Brown Rice</h3> <p class='article-color'>“Brown rice is better for you than white rice since it is not refined and bleached of nutrients. Also, it is easily digested and less likely to cause bloating and spikes in blood sugar,” says Hayim. Make a big batch at the beginning of the week and use it with different proteins, veggies, and sauces. </p><h3>9 Almond Butter</h3> <p class='article-color'>The possibilities of this tasty spread are endless. “Add a few tablespoons of almond butter into your favorite smoothie or use as a spread or dip. One tablespoon of almond butter has about four grams of protein and eight grams of fat,” says Dr. Taz. We all know protein is king for ripped ‘n’ fit folks, but don’t forget the key role fat plays: “Fat is important for functional training as well since it is another great source of long-lasting energy.” </p><h3>10 Oatmeal</h3> <p class='article-color'>Oatmeal is a stellar breakfast companion, is trendy when dressed up as overnight oats, and is versatile enough to be used as 15 Ways to Lose Weight with Oatmeal. For functional trainingters, though, it’s an incredible must-have, too: “Oatmeal is a great pre or post-workout food as it delivers carbohydrates to the body efficiently without unnecessary sugars,” shares Hayim. “It also happens to be excellent for muscle recovery.” </p><h3>11 Low-Fat Chocolate Milk</h3> <p class='article-color'>We saved the best for last, now didn’t we? “Studies suggest that chocolate milk, which is high in carbohydrates and protein, may be considered an effective drink for recovery from exhausting glycogen-depleting exercise, like functional training,” explains Hayim. Just remember to wipe off that ‘stache </p></div>",
  "url": ""
  },
  {
  "id": 2,
  "date": "Posted on 20 October 2020",
  "type": "Nutrition",
  "title": "5 Nutrition Tips for functional training Athletes",
  "subtitle": "How can you ensure that all your hardwork at the box is giving you optimal results?",
  "cover": "https://images.unsplash.com/photo-1535914254981-b5012eebbd15?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=300&q=80",
  "paragraph": "<div class='mt-2'> <p class='article-color'>How can you ensure that all your hard work at the box is giving you optimal results?functional training athletes push themselves as hard as they can during WODs, but many lack the knowledge about proper nutrition pre and post-workout. Most cross-fitters don’t realize that nutrition, hydration, and recovery are what enables athletes to have optimal performance. </p><h3>1. Hydration: </h3> <p class='article-color'>Our bodies are primarily made up of water (70% of muscle is water). During WODs, we sweat a lot, it is extremely important to hydrate BEFORE, DURING, and AFTER workouts. Make sure you bring a water bottle with you and DRINK it.2. Recommended amounts:3. 15-20 ounces of water prior to working out4. 10 ounces of water every 20 minutes during the workout5. Additional 8-15 ounces post-workout </p><h3>2. Breakfast: </h3> <p class='article-color'>Frequently, I hear from the “dawn patrol” athletes that they skip breakfast because it’s too early to eat. Here’s the issue, your body is in a fasting state from sleeping the night before and your glycogen stores are the lowest in the morning. Unfortunately, when you work out on an empty stomach your body breaks down MUSCLE before fat. High-intensity exercise on an empty stomach does NOT help you burn fat! </p><h3>2. Tip: </h3> <p class='article-color'>Have a source of carbohydrate and protein for breakfast, with a large glass of water! </p><h3>3. Post-workout:</h3> <p class='article-color'>The majority of cross-fitters would be surprised to find out that protein is NOT the most important macronutrient to consume immediately after a workout. Replacing depleted carbohydrates stored in your body is the most important thing to do directly after working out. You have a 30-minute window to eat carbohydrates after workouts to ensure optimal replacement of your glycogen stores. This is important because it will help with faster recovery and improve your performance the next time you workout! Don’t get me wrong, protein is important too, but you have about an hour to consume protein after a workout. </p><h3>3. Tip:</h3> <p class='article-color'>Bring a banana with you after your workout to eat on the way home. If you aren’t able to eat within an hour, a supplement shake would be a good option (ideally containing about 30 grams of carbohydrates and 30 grams of protein). </p><h3>4. Are you a meathead?</h3> <p class='article-color'>Most people think the more protein the better. When trying to build muscle, your protein requirements are higher than an average individual but don’t take that to the extreme. The problem with excessive amounts of protein is that you are putting a lot of stress on your kidneys, which causes damage over an extended period of time. The average person can only absorb about 30 grams at a time, which is why it is recommended to consume about 4 ounces of protein per sitting. Protein recommendations are based on weight, and your health goals (ie gain muscle, lose weight). </p><h3>5. Vitamins on vitamins on vitamins:</h3> <p class='article-color'>Do you really need to be taking all these supplements? I ALWAYS tell my clients, the whole food is best. The supplement industry isn’t regulated or tested, and many contain metals. Many supplements are very hard for your body to digest because they contain binders and fillers. If you follow a balanced diet with adequate amounts of colorful fruits and veggies, you will be getting the vitamins and minerals you need. There are very few supplements that I actually would recommend. OMEGA 3 supplements are something that I recommend to all of my clients. Omega 3s have an abundance of health benefits including improvement of heart health, decreasing inflammation, decrease recovery time, and decrease your body’s reaction to stress (workouts). </p></div>",
  "url": ""
  }
]