[
  {
  "id": 1,
  "date": "Posted on 28 May 2021",
  "type": "Lifestyle",
  "title": "6 Beginner hula hoop moves to try.",
  "subtitle": "Whether or not you have chosen to begin your hooping",
  "cover": "https://images.pexels.com/photos/8895613/pexels-photo-8895613.jpeg?auto=compress&cs=tinysrgb&dpr=2&w=260",
  "paragraph": "<div class='mt-2'> <p class='article-color'>With the summer in our midst, it's time to go outside and get fit with hoop dancing. Whether or not you have chosen to begin your hooping journey, it's great to learn and practice these basic moves. You'll be flowing with hoops in no time. </p><h3>1. Waist hooping</h3> <p class='article-color'>The most basic hoop move of them all, of course, is waist hooping. Although it is around the body, the move is all in the foot. If you need to get the hoop going and not fall down, plant one foot in front of the other, and then begin your first rotation by starting the hoop and pushing it as hard as you can. Then begin to rock back and forth from one foot to the other as you shift your weight. Eventually, you will begin to feel the hoop touching your body in the same places, and you will get into a groove. Remember: This takes practice. Have patience and don't give up. </p><h3>2. Hand hooping</h3> <p class='article-color'>Begin by putting your right hand out, as if you were going to give someone a handshake and keep your thumb up. Place the hoop in the corner of your thumb and hand; this is the sweet spot for hand hooping. You can then grab the hoop at the bottom, with the top of the hoop to the sky, then let the hoop fall and open your hand like you are giving a handshake. Once the hoop falls, you move your hand up and down briskly for the hoop to continue to circle around your hand. </p><h3>3. Halo</h3> <p class='article-color'>This is very similar to hooping on your hand, except it is above your head.The easiest way to begin this move is to hold the hoop flat in front of you, then begin to spin around and slowly lift your hand up while spinning. As soon as the the hoop is above your head, let the hoop spin in your hand in the same way you spin it in front of you. </p><h3>4. Spinning</h3> <p class='article-color'>One of the most basic and useful moves of the hoop world is the spin. Sounds easy, but see how long you can spin around in a circle without getting dizzy... you're probably dizzy as you're reading this.You want to get your spinning down, as it makes 80 percent of all hoop moves easier to do. Try to waist hoop and spin around and watch what happens. The trick is to focus your eyes on one point and continue to turn your body and make contact with the hoop. </p><h3>5. Neck hooping</h3> <p class='article-color'>OK, so it's not particularly a beautiful move, and most hoopers don't do it very often, but it is the first step to begin shoulder hooping. So get this movement down and you'll be on your way.This motion is very similar to waist hooping. Hold the hoop at your neck and throw the hoop around it. When you catch the sweet spot in your spin (usually at the second rotation), you will then rock the top half of your body back and forth, just like waist hooping. </p><h3>6. Flow</h3> <p class='article-color'>Turn on your favorite song or album and just dance. This is the simplest way to learn your style and come up with new moves. When you're in the moment, it's easy to transition your movements and let your body do what it naturally does. </p></div>",
  "url": ""
  },
  {
  "id": 2,
  "date": "Posted on 7 June 2021",
  "type": "Tips",
  "title": "Using the Hula Hoop.",
  "subtitle": "Hula hooping is one of the most popular forms",
  "cover": "https://images.pexels.com/photos/8890056/pexels-photo-8890056.jpeg?auto=compress&cs=tinysrgb&dpr=2&w=260",
  "paragraph": "<div class='mt-2'> <p class='article-color'> Hula hooping is one of the mostpopular forms of exercise. Not onlyis it fun, but it’s incredibly easy. Infour simple steps, anyone can getup and give their hoop a spin. </p><p class='article-color'> 1. Stand with your feet shoulderwidth apart. Hold the hoop atwaist height with both handsand then give it a good spin. </p><p class='article-color'>2. Shift your weight between yourfront and back foot to keep thehoop spinning and maintainmomentum. </p><p class='article-color'> 3. Don’t worry if you struggleto maintain momentumand the hoop falls. The moreyou practice, the more yourtechnique will improve. </p></div>",
  "url": ""
  },
  {
  "id": 3,
  "date": "Posted on 10 June 2021",
  "type": "Lifestyle",
  "title": "Do’s and Don’ts of Hula Hooping.",
  "subtitle": "Do keep your spine relaxed and natural. Do not arch it.",
  "cover": "https://images.pexels.com/photos/8895611/pexels-photo-8895611.jpeg?auto=compress&cs=tinysrgb&dpr=2&w=260",
  "paragraph": "<div class='mt-2'> <h3>Do's</h3> <div class='article-color'> <ul> <li>Do keep your spine relaxed and natural. Do not arch it. </li><li>Do move your hips in a front and back motion with one footin front of the other or move the hips side to side.</li><li>Do practice both directions to evenly tone your muscles.</li><li>Do keep your arms up out of the way.</li><li>Do find an open space where you canmove comfortably. You don’t want yourhoop to snag on furniture or pillars andimpede movement.</li><li>Do be patient and work up yourstamina. Start by Hula Hoopingfor 10 minutes every dayfor two weeks. Onceyour stamina improves,you should strive to hoopfor thirty minutes at atime.</li></ul> </div><h3>Don'ts</h3> <div class='article-color'> <ul> <li>Don’t use Weighted Hula Hoops, they are unnecessary and uncomfortable, they restrict your movement. </li><li>Don’t use Weighted Hula Hoops on your arms or wrists;they’re too heavy. </li><li>Don’t move your hips in circular motion, this slows the hoopdown. </li></ul> </div></div>",
  "url": ""
  },
  {
  "id": 4,
  "date": "Posted on 10 June 2021",
  "type": "Lifestyle",
  "title": "10 Reasons to Start Hula Hooping Right Now.",
  "subtitle": "Hula hooping is one of the most popular forms of exercise.",
  "cover": "https://images.pexels.com/photos/6339610/pexels-photo-6339610.jpeg?auto=compress&cs=tinysrgb&dpr=2&w=260",
  "paragraph": "<div class='mt-2'> <p class='article-color'> Hula hooping is one of the mostpopular forms of exercise. Not onlyis it fun, but it’s incredibly easy. Infour simple steps, anyone can getup and give their hoop a spin. </p><h3>1. Mood Enhancer</h3> <p class='article-color'>When you hoop up a sweat and increase your heart rate levels of neurochemicals serotonin, dopamine and norepinephrine rise in your body. This is what makes you feel oh so good while dancing around in your hoop. </p><h3>2. Belly Blaster</h3> <p class='article-color'>Excess fat around the midsection is a strong risk factor for heart disease, type 2 diabetes, and even some types of cancers. Blasting away belly fat by hooping is not only fun but it is essential for your health. </p><h3>3. Stand Taller</h3> <p class='article-color'>Core strength is king! The strong core you gain from hooping will not only help to prevent pain and injury it will strengthen and improve your posture. </p><h3>4. Disco Dancer</h3> <p class='article-color'>There is nothing worse than hearing your fav song come on but feeling too intimidated to dance and express yourself. The hoop is the ultimate dance teacher and partner. </p><h3>5. Balance Giver</h3> <p class='article-color'>Hooping uses the left and right side of the brain and body improving strength and balance. When the body and mind are in balance so is life. The ultimate goal. </p><h3>6. Brain Booster</h3> <p class='article-color'>Our beautiful brains have the ability to grow with new behaviours, experiences and focus. This is called neuroplasticity. As hoopers constantly learning moves and meeting new challenges we are strengthening our brains. </p><h3>7. Friend Finder</h3> <p class='article-color'>Hooping is a great way to make new friends. With hoop groups and classes popping up all over the world and internet it is easy to find new hooper friends anywhere. Teach a friend today! </p><h3>8. Heart Starter</h3> <p class='article-color'>A strong, healthy heart is essential. Increasing the heart rate often through hooping not only builds stamina and strength but helps to burn fat and support weight loss. </p><h3>9. Soul Shaker</h3> <p class='article-color'>Hooping gives you a way and a reason to express your self, bring out your inner creative and shine your brilliant light. </p><h3>10. Confidence Booster</h3> <p class='article-color'>Hoopers around the world report skyrocketing levels of confidence, finding new level of self respect and many even thank hooping for helping them to manage their depression and anxiety. </p></div>",
  "url": ""
  },
  {
  "id": 5,
  "date": "Posted on 14 June 2021",
  "type": "Lifestyle",
  "title": "Do I really need a weighted hoop?",
  "subtitle": "Weighted hoops. Are they more effective than dance hoops?",
  "cover": "https://images.pexels.com/photos/4379090/pexels-photo-4379090.jpeg?auto=compress&cs=tinysrgb&dpr=2&w=260",
  "paragraph": "<div class='mt-2'> <p class='article-color'> Weighted hoops. Are they more effective than dance hoops? Do they burn more calories? Do you need a weighted hoop? To answer these questions I had to do a test. The results were interesting. </p><h3>First of all, let’s define what a Weighted Hoop really is.</h3> <p class='article-color'> A hoop that weighs more than 1kg/2lbs is usually considered a weighted hoop. Hoops that are made of extra heavy plastic, rubber and sometimes metal are referred to as weighted hoops. Some hoop makers may call their hoops weighted hoops even when they are not very heavy, so it is best to check the weight and size of your hoop before you buy it. </p><h3>Results and opinions:</h3> <p class='article-color'> After waist hooping with the weighted hoop for 10 mins I burned 40 calories. After waist hooping with the dance hoop for 10 minutes I burned 58 calories. <br/> <b>The Weighted Hoop made me feel uncomfortable and almost a little sick in the stomach.</b> The weight was far too heavy and I would not feel safe dancing, moving or doing any tricks with the heavy, weighted hoop. I felt certain that it would bruise me and I was scared to drop it on my feet. </p><p class='article-color'> The Dance Hoop felt more comfortable and because it was lighter, but not too light, I had to work a little harder and felt my muscles activated more and it gave me more of that euphoric feeling that I love from a workout. <br/> In my opinion, <b>extra heavy, Weighted Hoops are unnecessary and uncomfortable, they restrict my movement.</b> Movement is what burns more calories and makes me feel more toned, stronger and more creative. <b>I am worried that the extra heavy weight might cause bruising on my waist or be doing damage to my body.</b> </p><p class='article-color'>Beginner hoopers or hoopers who enjoy on body hooping  should be looking for a diameter that makes it easy for them to keep the hoop up and spinning but they do not need the extra, uncomfortable weight of a heavy, weighted hoop. </p><h3>Please read these instructions if you still want to get a weighted hula hoop.</h3> <div class='article-color'> <ul> <li>Weighted Hula Hoops are an exercise aid and must alwaysbe used with correct technique.</li><li>Always consult your doctor prior to commencing any newexercise programme.</li><li>Please do not use this item or these exercises as a substitutefor any exercise, treatment, dietary regime, or rehabilitationwhich has been prescribed by a doctor.</li><li>If you experience discomfort or unusual pain while usingCore Balance items, or while following Core Balance exerciseguides, stop the activity immediately.</li><li>The information contained within this document are notmedical guidelines but for educational purposes only. CoreBalance cannot be held liable for user’s safety when using aHula Hoop.</li></ul> </div></div>",
  "url": ""
  },
  {
  "id": 6,
  "date": "Posted on 17 May 2022",
  "type": "Lifestyle",
  "title": "Health benefits of dumbbells",
  "subtitle": "A person can incorporate dumbbells into their...",
  "cover": "https://images.unsplash.com/photo-1534438327276-14e5300c3a48?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=260",
  "paragraph": "<div class='mt-2'><p class='article-color'> A person can incorporate dumbbells into their resistance training routine. The American Heart Association (AHA)Trusted Source recommends that people engage in resistance training at least twice per week. </p><h3>Benefits include:</h3><ul class='article-color'> <li>boosting resting metabolic rate, or burning calories</li><li>protecting against injury</li><li>strengthening the bones, muscles, and connective tissue</li></ul><p class='article-color'>Using dumbbells also has other benefits. According to the American Council on Exercise (ACE), the benefits of using dumbbells includes the following:</p><ul class='article-color'> <li>They activate a number of different muscles and stimulate muscle growth.</li><li>They can help improve both muscle force and flexibility.</li><li>They can promote coordination and stability for muscles and joints.</li><li>They are suitable for a number of exercises.</li></ul><p class='article-color'>Learn more about building muscle with our new app. Download it <a href='https://bit.ly/dumbbellapp' style='text-decoration: underline;'>here</a> for free to support our work.</p><p class='article-color'>The National Institutes of Health (NIH) note that strength training can provide numerous health benefits. In addition to strengthening the muscles, strength training can help prevent chronic conditions, such as diabetes and heart disease.</p></div>",
  "url": ""
  }
]