[
  {
  "id": 1,
  "date": "Posted on 19 September 2020",
  "type": "Lifestyle",
  "title": "What is CrossFit?",
  "subtitle": "CrossFit is a lifestyle characterized by safe, effective exercise and sound nutrition.",
  "cover": "https://images.unsplash.com/photo-1541534741688-6078c6bfb5c5?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=300&q=80",
  "paragraph": "<div class='mt-2'> <p class='article-color'>CrossFit is a lifestyle characterized by safe, effective exercise and sound nutrition. CrossFit can be used to accomplish any goal, from improved health to weight loss to better performance. The program works for everyone — people who are just starting out and people who have trained for years. </p><h3>THE WORKOUTS</h3> <p class='article-color'> The magic is in the movement. CrossFit workouts are different every day and can be modified to help each athlete achieve their goals. The workouts may be adapted for people at any age and level of fitness. </p><figure> <img src='https://images.unsplash.com/photo-1519311965067-36d3e5f33d39?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=300&q=80' alt='image' class='imaged img-fluid'> </figure> <h3>THE LIFESTYLE</h3> <p class='article-color'> Off the carbs, off the couch. The CrossFit lifestyle — a combination of sound nutrition and exercise — is the key to fitness and long-term health. </p><figure> <img src='https://images.unsplash.com/photo-1490645935967-10de6ba17061?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=300&q=80' alt='image' class='imaged img-fluid'> </figure> <h3>CONSTANT VARIATION</h3> <p class='article-color'> Different every day, CrossFit workouts are tailored to the individual. </p><h3>FUNCTIONAL MOVEMENTS</h3> <p class='article-color'> CrossFit uses safe, effective, and efficient movements similar to those you use every day in life. </p><h3>HIGH INTENSITY</h3> <p class='article-color'> In CrossFit workouts, intensity levels are adjusted to challenge the individual and safely improve fitness. </p> <hr> <h3>Is CrossFit for me?</h3> <p class='article-color'> Yes. Everyone can do CrossFit regardless of age, injuries and current fitness levels. The program is modified for each person to help him or her safely become healthier and fitter. Grandparents and Olympians can perform modified versions of the same general workout. </p><h3>Do I need to be in shape to start CrossFit?</h3> <p class='article-color'> No. CrossFit is the program that will get you in shape. No matter what your current fitness level is, you can start CrossFit. As you become fitter, workouts will become more challenging. Every workout is designed to help you succeed, improve fitness and move you toward your goals. </p><h3>Is CrossFit safe?</h3> <p class='article-color'> Yes. CrossFit training is very safe, and sitting on your couch is actually incredibly dangerous. In CrossFit boxes, credentialed trainers provide precise instructions and coaching to help people move safely and efficiently, helping people avoid all the diseases that come from inactivity, obesity and poor nutrition. </p><h3>What about nutrition?</h3> <p class='article-color'> To accomplish your goals faster, we recommend you eat a variety of healthy foods in quantities that support fitness training but not body fat. By avoiding excessive amounts of refined carbohydrates and measuring your intake of protein, carbohydrates and fat, you will see dramatic, measurable increases in health. </p><h3>How will CrossFit affect my health?</h3> <p class='article-color'> CrossFit holds a uniquely elegant solution to the greatest problem facing the world today: chronic disease. The CrossFit program—constantly varied high-intensity functional movement coupled with meat and vegetables, nuts and seeds, some fruit, little starch, and no sugar—can give you a pass on chronic disease. If you are not sick, know that fitness provides a great margin of protection against the ravages of time and disease. Fitness is and should be “super-wellness.” To improve or preserve your health, do CrossFit. </p> </div>",
  "url": ""
  }
]