[
  {
  "id": 1,
  "date": "Posted on 19 September 2020",
  "type": "Lifestyle",
  "title": "What is functional fitness?",
  "subtitle": "functional fitness is a lifestyle characterized by safe, effective exercise and sound nutrition.",
  "cover": "https://images.unsplash.com/photo-1541534741688-6078c6bfb5c5?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=300&q=80",
  "paragraph": "<div class='mt-2'> <p class='article-color'>functional fitness is a lifestyle characterized by safe, effective exercise and sound nutrition. functional fitness can be used to accomplish any goal, from improved health to weight loss to better performance. The program works for everyone — people who are just starting out and people who have trained for years. </p><h3>THE WORKOUTS</h3> <p class='article-color'> The magic is in the movement. functional fitness workouts are different every day and can be modified to help each athlete achieve their goals. The workouts may be adapted for people at any age and level of fitness. </p> <h3>THE LIFESTYLE</h3> <p class='article-color'> Off the carbs, off the couch. The functional fitness lifestyle — a combination of sound nutrition and exercise — is the key to fitness and long-term health. </p> <h3>CONSTANT VARIATION</h3> <p class='article-color'> Different every day, functional fitness workouts are tailored to the individual. </p><h3>FUNCTIONAL MOVEMENTS</h3> <p class='article-color'> functional fitness uses safe, effective, and efficient movements similar to those you use every day in life. </p><h3>HIGH INTENSITY</h3> <p class='article-color'> In functional fitness workouts, intensity levels are adjusted to challenge the individual and safely improve fitness. </p> <hr> <h3>Is functional fitness for me?</h3> <p class='article-color'> Yes. Everyone can do functional fitness regardless of age, injuries and current fitness levels. The program is modified for each person to help him or her safely become healthier and fitter. Grandparents and Olympians can perform modified versions of the same general workout. </p><h3>Do I need to be in shape to start functional fitness?</h3> <p class='article-color'> No. functional fitness is the program that will get you in shape. No matter what your current fitness level is, you can start functional fitness. As you become fitter, workouts will become more challenging. Every workout is designed to help you succeed, improve fitness and move you toward your goals. </p><h3>Is functional fitness safe?</h3> <p class='article-color'> Yes. functional fitness training is very safe, and sitting on your couch is actually incredibly dangerous. In functional fitness boxes, credentialed trainers provide precise instructions and coaching to help people move safely and efficiently, helping people avoid all the diseases that come from inactivity, obesity and poor nutrition. </p><h3>What about nutrition?</h3> <p class='article-color'> To accomplish your goals faster, we recommend you eat a variety of healthy foods in quantities that support fitness training but not body fat. By avoiding excessive amounts of refined carbohydrates and measuring your intake of protein, carbohydrates and fat, you will see dramatic, measurable increases in health. </p><h3>How will functional fitness affect my health?</h3> <p class='article-color'> functional fitness holds a uniquely elegant solution to the greatest problem facing the world today: chronic disease. The functional fitness program—constantly varied high-intensity functional movement coupled with meat and vegetables, nuts and seeds, some fruit, little starch, and no sugar—can give you a pass on chronic disease. If you are not sick, know that fitness provides a great margin of protection against the ravages of time and disease. Fitness is and should be “super-wellness.” To improve or preserve your health, do functional fitness. </p> </div>",
  "url": ""
  },
  {
  "id": 2,
  "date": "Posted on 12 October 2020",
  "type": "Lifestyle",
  "title": "What Are the Benefits of functional fitness and Is It Safe?",
  "subtitle": "The high-intensity, multi-joint movements in functional fitness may help you gain muscle strength",
  "cover": "https://images.unsplash.com/photo-1598136490941-30d885318abd?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=300&q=80",
  "paragraph": "<div class='mt-2'> <p class='article-color'></p><h3>1. May improve physical strength </h3> <p class='article-color'> The high-intensity, multi-joint movements in functional fitness may help you gain muscle strength and stamina. Adding additional weight to your workouts can further increase muscle gain by adding stress to your muscles.You can also continuously challenge your muscles by participating in the workout of the day, which will give your muscles some variety. The workout of the day, or WOD, is a signature part of the functional fitness program. Each day, a new set of exercises is posted. The goal is then to complete as many repetitions of each exercise as possible in a set period of time. </p><h3>2. May help you improve aerobic fitness </h3> <p class='article-color'> functional fitness’s high-intensity power training (HIPT). This type of training may help to increase VO2 max, or the maximum amount of oxygen you can utilize during exercise.However, research has been inconclusive on both the short- and long-term effects of functional fitness on physiological changes and aerobic benefits. More research is needed to understand how functional fitness improves aerobic fitness compared to other forms of exercise. </p><h3>3. Improve agility, balance, and flexibility </h3> <p class='article-color'> functional fitness workouts often include functional exercises, or exercises that mimic movements you do in everyday life. Functional movements, such as squats, kettlebell swings, or overhead presses, can help improve agility, balance, and flexibility.They also can reduce your risk for injury and improve your quality of life as you age. </p><h3>4. Burn calories and manage weight</h3> <p class='article-color'> functional fitness workouts may help you burn more calories than other workouts. On average, a 195-pound male or 165-pound female will burn 15 to 18 calories per minute and 13 to 15 calories per minute, respectively, during a functional fitness circuit. You may also continue to burn calories during the recovery period.That’s compared to 11 calories per minute and 9 calories per minute during traditional weightlifting using machines.If your goal is weight loss, try following a healthy diet in addition to following a functional fitness exercise regimen. </p><h3>Is functional fitness safe?</h3> <p class='article-color'> functional fitness is a high-intensity form of exercise. Your risk for injuries increases anytime you increase the intensity of your workouts or the amount of weight you’re lifting.Some common functional fitness injuries include: low back pain rotator cuff tendonitis Achilles tendonitis knee injuries tennis elbowIf you’re new to functional fitness, it’s a smart idea to work with a trained fitness professional that can make sure you’re doing the exercises properly. Having improper form, trying to move through exercises too quickly, or lifting more than you can handle can all lead to injury.Beginners should go at a slower pace and increase weight gradually until your fitness level improves.functional fitness isn’t safe for everyone. If you’re pregnant and already practicing functional fitness, it may be fine to continue, but make sure to talk to your doctor first. If you’re pregnant and new to functional fitness, you should wait until after your pregnancy to start.functional fitness isn’t safe if you’re injured or have other serious health concerns, either. Make sure you get cleared by your doctor first or work with a physical therapist before starting functional fitness.If you’re over age 65 and already physically fit, functional fitness may or may not be safe for you to try. Talk to your doctor before starting. </p></div>",
  "url": ""
  },
  {
  "id": 3,
  "date": "Posted on 20 October 2020",
  "type": "Lifestyle",
  "title": "Six basic functional fitness facts",
  "subtitle": "functional fitness program is designed to be utilized by anyone in the world",
  "cover": "https://images.unsplash.com/photo-1533681904393-9ab6eee7e408?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=300&q=80",
  "paragraph": "<div class='mt-2'> <h3>1. functional fitness IS FOR EVERYONE. </h3> <p class='article-color'>The functional fitness program is designed to be utilized by anyone in the world no matter what their training experience, level or quality of equipment. So don’t be afraid to give it a try. </p><h3>2. functional fitness MAKES WELL-ROUNDED ATHLETES. </h3> <p class='article-color'> functional fitness workouts incorporate elements from all different disciplines of fitness: high-intensity interval training, Olympic weightlifting, plyometrics, powerlifting, gymnastics, calisthenics, strongman— creating well-rounded athletes able to be competitive in any discipline. functional fitness works well with other sports. It helps athletes perform better! </p><h3>3. functional fitness IS WORLDWIDE. </h3> <p class='article-color'>There are currently over 13,000 affiliates around the world That makes us part of something huge! As a member in an affiliate, you can register for competitions locally and around the world! </p><h3>4. MAJORITY OF functional fitnessTERS ARE FEMALE.</h3> <p class='article-color'>Out of the 10 million self-described functional fitnessters, 60% are female –according to the american council on exercise. So ladies, who says only boys can lift? </p><h3>5. functional fitness CHANGES YOUR BODY.</h3> <p class='article-color'> Actively doing functional fitness for as little as two weeks can alter the body’s hormonal makeup. The mood benefits you get from 20 minutes of working out can last you 12 hours. functional fitness just makes people happy! </p><h3>6. functional fitness IS A COMMUNITY.</h3> <p class='article-color'>Although it looks intimidating, you’ll have a whole community of supportive people behind you, cheering you on. You’ll develop the best friendships and won’t have to work out alone! </p></div>",
  "url": ""
  },
  {
  "id": 4,
  "date": "Posted on 20 October 2020",
  "type": "Lifestyle",
  "title": "When You Begin functional fitness",
  "subtitle": "For those who are thinking about trying functional fitness",
  "cover": "https://images.unsplash.com/photo-1546749876-2088f8b19e09?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=300&q=80",
  "paragraph": "<div class='mt-2'> <p class='article-color'>For those who are thinking about trying functional fitness and rewriting their own futures, below are the first ten things that will happen. </p><h3>1. You will find out how truly out of shape you are.</h3> <p class='article-color'>It is likely that your first few sessions at a functional fitness gym will consist of stretching and basic instruction. You will likely sweat like a pig and require numerous breaks to catch your breath even during this relatively easy phase. This is because you are engaging and stretching muscles that have been dormant for years. You will also be sucking at the air for every molecule of oxygen you can get. It will be a week or two before your lungs are really open, prepare to gasp like a newborn taking its very first breath. </p><h3>2. You will realize how fat you and other regular people are compared to real athletes.</h3> <p class='article-color'> This is because your certified instructors will have the physiques of comic book superheroes. You will weigh 40 percent more than them but they will be somewhere between 50 and 150 percent stronger than you. It will make no sense that such “little” guys and girls are that much more powerful than you; it’ll be rather disorienting, especially if you’re a big guy like me who thought he was “strong” walking in. The instructors are not huge or freakishly jacked like traditional bodybuilders, but I wouldn’t want to bet against them in any contests of strength. The idea is to be able to lift heavy weights but in as efficient a manner as possible, and then to be able to run a mile while the old school bodybuilder huffs and puffs behind you. And you, big guy, are not strong. You are fat and incidentally may be able to lift some weight up. You will learn about real strength very soon. </p><h3>3. You will begin learning the lingo and using it without feeling like a dork:</h3> <p class='article-color'> RX: When one does the prescribed amount of weight and reps, one is said to have RX’d (as in, he or she followed the prescription). W.O.D (or WOD): Workout of the Day, this is the combination of exercises, prescribed weights, and time allotment that will be the law of the land from the first class to the last. Typically a WOD will consist of one gymnastic move (pull-ups, ring rows, sit-ups, etc.), one aspect of cardio (rowing, running, jumping rope, etc.) and one Olympic power-lifting maneuver (back squats, clean & jerks, deadlifts, push-presses, etc.). Box: functional fitness centers are not called gyms, they’re called “boxes” and many of them resemble just that. Typically they’ll be in warehouse-like spaces with cement walls, exposed rafters crisscrossing the ceiling, and naught but a black mat covering the length of the floors. There are no smoothie bars or aerobics studios in one’s peripheral vision, just the iron bar you’ll hang from, the weights you’ll thrust up above your head, and the ground you’ll drip your perspiration and occasional tears into until you feel as though you’ve become a part of the place. This is your box. There are thousands of functional fitness boxes across the country, but this one is yours. </p><h3>4. Your friends and family will start Googling the term functional fitness and giving you warnings.</h3> <p class='article-color'> “Oh, you’re doing that Cross thing, I think I just read something about that...” They will come across a rare disorder wherein people push themselves past the exhaustion point until their muscle fibers begin to break down and slip through the bloodstream into their kidneys. They will also come across stories about injuries and the like associated with functional fitness search terms. The reality is that these types of injuries can and do occur with any kind of training if taken too far and under the wrong type of supervision. You are equally likely to be injured while ice skating, lifting weights alone, horseback riding, surfing, or doing any other type of strenuous activity if you are engaging recklessly and not taking the proper precautions. I would also note that there is an ongoing fear-mongering campaign being waged by the traditional fitness clubs and gyms. They see the proliferation of the functional fitness movement across the country as a massive threat to their membership rolls. There is no possible way that a guy doing his usual leisurely circuit around the same 12 or 15 machines in a gym is ever going to get the intensity of a workout at a functional fitness box. </p><h3>5. You will get insanely good at counting.</h3> <p class='article-color'> Everything in functional fitness is about reps. 20 clean & jerks followed by 10 box-jumps topped off with 30 sit-ups, then repeat five times and compete for time. Think about the counting, the counting down, the mental division of large quantities of reps into small, more manageable-seeming blocks. “Okay, let me get five more then take a breath and then just three more and then only two sets left until I’m three-fifths of the way through the five rounds.” This is the kind of conversation you’re carrying on with yourself in the heat of the W.O.D. and you’ll become very proficient at counting backward as well — “seven more...six, five more, c’mon, four...” Whatever it takes to get you through. </p><h3>6. You’ll begin to respect endurance and stamina.</h3> <p class='article-color'> When you’re a kid, your idea of strength revolves around how much one can lift, what someone’s arms and chest look like, etc. If you haven’t yet grown out of this idea, you will upon beginning functional fitness. You will begin to be much more amazed at things like quad strength and lower back strength. You’ll be blown away by the ability of others to do hundreds of air squats or hold various static positions (holding one’s body in a plank six inches above the ground or half-squatting with one’s back against the wall, with thighs perpendicular to the ground and a 20-pound medicine ball pressed to one’s chest. When you can barely get through 30 seconds in these positions but you see someone hold them for 4 to 6 minutes, all of your ideas about what being strong means will be out the window. </p><h3>7. You will gain weight at first.</h3> <p class='article-color'> The most frustrating part of my first month at functional fitness was the weight gain. Simply stated, because you are using muscles that have been out of the game for years, you will be building those muscles rather rapidly, and muscle weighs more than fat. So while you will definitely be shedding water weight puffiness and sweating like you’ve been on a scavenger hunt in a rainforest, the scale will be ticking up not down. This will drive you f***ing crazy. And then, all of a sudden, you will hit that tipping point where the muscle you’ve been adding is burning enough calories each night to have you start to drop pounds. Then you’ll start to see your clothes fit better and your face shrink. All downhill from here provided you keep going. </p><h3>8. You’ll notice an uptick in energy, even when you’re dead sore from functional fitnessting.</h3> <p class='article-color'> This new-found energy bounce comes from the fact that you’re dragging less fat around with you all day and you’re breathing easier. You’re putting less wear and tear on your cardiovascular and pulmonary systems and the dividend is you can keep up with your kids and accomplish more each day. The confidence and happiness that comes along with this are self-explanatory. Wait till you see the little and unexpected ways in which these peripheral benefits creep into your daily routine at home and at work! </p><h3>9. You will learn about your mental weakness.</h3> <p class='article-color'> My box, the functional fitness Lighthouse, posts the Workout of the Day on their website each morning. Three weeks in, once I had learned all the various exercises, I found myself hitting up the site and deciding based on what the W.O.D. was whether or not I was going to attend that day. One day I logged on and saw that there were 3 sets of 20 burpees included, which immediately triggered an inner dialog that went something like this: “I just did burpees on Tuesday and I’m still sore, maybe tonight will be my rest night and I’ll go tomorrow and Friday instead.” I realized that I was picking and choosing the workouts like they were on an a la carte menu, “I’ll do this but I’m skipping that because my ankle is acting up.” Once I realized this about myself, I stopped going to the site. I learned to deny myself the opportunity going forward. This is one example of many revelatory moments that have allowed me to get to know myself much better and make the appropriate adjustments. </p><h3>10. You will learn a lot about your mental toughness.</h3> <p class='article-color'> You will find that you barely knew yourself at all before beginning this adventure. That you didn’t have a clue about what really made you tick, your own elemental motivations and desires. In the heat of battle, when your head is soaked in sweat and there is nothing but the clanging of metal and the grunting of others around you, you will reach inside of yourself and go to that next level. When you realize that you are 80 percent of the way through a particularly punishing workout, you will dig deep and find what you need to get through to the other side. It’s there, and maybe you haven’t had to access it in years — decades — but when you finally do...my god. There is an apotheosis underway. And on the other side of an experience like that (or a series of them), you are a lot less hesitant to step into the breach. You have gained knowledge (or in some cases, a remembrance) of yourself and what you’re capable of. I pity the person, in life or in business, who dares to face off against you once this has taken place. It won’t be fair to them in the least. </p></div>",
  "url": ""
  },
  {
  "id": 5,
  "date": "Posted on 20 October 2020",
  "type": "Lifestyle",
  "title": "Top 10 functional fitness Health Benefits",
  "subtitle": "Well, there are plenty of reasons why fitness ",
  "cover": "https://images.unsplash.com/photo-1598136490929-292a0a7890c2?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=300&q=80",
  "paragraph": "<div class='mt-2'> <p class='article-color'>Well, there are plenty of reasons why fitness enthusiasts are going crazy over this regimen. Here are a few benefits of functional fitness Workouts: </p><h3>Intensity:</h3> <p class='article-color'>functional fitness is a fast-paced, intense workout that can take less than 15 minutes a day because that quarter of an hour is going to be condensed, nonstop movement. It may only be three or four routines, such as burpees, a jog, and squats, but the idea is that you keep doing each one over and over through the set time. It’s a concentrated shot of exercise and it burns the system — in a good way. </p><h3>Motivation:</h3> <p class='article-color'>The key to functional fitness is the intensity, but hidden in that fact is that you’re inherently pushing yourself to do the most you can through each exercise in the workout. Everyone wants results, but not everyone puts in the effort. In a regular gym, it’s easy to cheat reps here and there or sneak a longer break than necessary, but because of how the functional fitness workout is tailored, there’s no option other than to max yourself out. </p><h3>Time efficient:</h3> <p class='article-color'> In a span of 15 or 20 minutes, you’ll be asked to complete as many rounds of a specific circuit as you can. By the end of it, because of the aforementioned intensity and effort, you’ll have burned more calories than a regular workout. </p><h3>Building relationships:</h3> <p class='article-color'>Often times a gym is just a collection of random people focused on doing their own different exercises. At a functional fitness box, which is what they refer to as their gym, it’s community. You’re surrounded by a group of people – even strangers! – who encourage you and help you push your boundaries. Even the people who finish last get a round of high-fives for pushing themselves as hard as they can. Everyone has the same goal in mind: to get in the best shape possible. The camaraderie in functional fitness is part of what makes this exercise experience so unique. </p><h3>Dynamic workouts:</h3> <p class='article-color'>The workouts are sometimes hard to describe because they are so multidimensional. When you’re doing functional fitness, you’re not just going to the gym to bulk up or to climb steps. This isn’t a basic circuit of weightlifting; it’s a program that mixes many different exercises that push all parts of your body to their limits. As they say, functional fitness’s specialty is not specializing. It’s constantly changing, which keeps your mind and body from getting bored. </p><h3>Personal coaching:</h3> <p class='article-color'>All functional fitness classes are led by a coach to ensure proper form, provide modifications, encouragement, uphold standards, and occasionally give you a “no rep” when they see you not doing something properly or not giving your full effort. Your coach will become an inspiration, counselor, buddy, nutrition advisor, and your biggest cheerleader. </p><h3>Improved heart health:</h3> <p class='article-color'>Your heart rate remains elevated throughout the entire workout, which increases your endurance. In fact, data from an American Council on Exercise study showed that participants’ heart rates were elevated to 90 percent of maximum heart rate, which was sustained throughout two functional fitness workouts. Fitness industry guidelines suggest an HRmax between 64 to 94 percent in order to improve cardio endurance. Scientists also found that individuals averaged 80 percent of VO2max, which is the maximum amount of oxygen a person can utilize during intense exercise. Industry guidelines suggest 40 to 85 percent of VO2max for improving cardio fitness and body composition. </p><h3>Increased joint mobility:</h3> <p class='article-color'>This is a result of the varied functional movements involved in a functional fitness workout – you’re not just doing simple bicep curls, but moving your limbs in all different directions. Also, by learning the proper ways to lift heavy things off the floor and hold them overhead, your risk of injury in your everyday life significantly decreases. </p><h3>Overall improved health:</h3> <p class='article-color'>functional fitness was created to focus on these major domains: stamina, strength, coordination, flexibility, power, speed, agility, balance, accuracy, endurance. This is achieved by promoting neurological and hormonal adaptations across all of the metabolic pathways in the body. The combination of the vast variety of movements leads to a complete transformation of your personal quality of life. </p><h3>Lifestyle improvement:</h3> <p class='article-color'>Being surrounded by people invested in fitness and health, it is hard to resist giving in to some new lifestyle habits. Before you know it you will be trading your pre-packaged snacks for something whole and real. Rather a meet your friends for lunch/drinks/coffee, you’ll meet at the gym, and THEN head out to socialize. </p></div>",
  "url": ""
  },
  {
  "id": 6,
  "date": "Posted on 20 October 2020",
  "type": "Nutrition",
  "title": "The Best Foods for functional fitnessters",
  "subtitle": "These foods get your body functioning in an optimal",
  "cover": "https://images.unsplash.com/photo-1497888329096-51c27beff665?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=300&q=80",
  "paragraph": "<div class='mt-2'> <p class='article-color'>These foods get your body functioning in an optimal, supercharged state that will have you flippin’ tires in no time! Check ‘em out and then keep reading to see what to avoid.1 Lentil“functional fitnessters need to keep their protein intake around 30 percent of their daily calories—and lentils add a whopping nine grams per half-cup to your meal, with loads of fiber. </p><h3> 2 Banana and Whey Protein Smoothie </h3> <p class='article-color'>“Post-workout, you need to fuel and optimize recovery by replenishing glycogen stores and protein for tissue repair. Your body craves both fast-absorbing carbohydrates, like those in fruits and berries, and protein that's quick and easy to absorb like whey,” comments Lisa Hayim, registered dietitian and founder of The WellNecessities. Just make sure your whey protein powder is clean and not a laundry list of ingredients and additives. For some smoothie inspiration, check out the 23 Best Protein Shake Recipes for Weight Loss! </p><h3>3 Coconut Oil </h3> <p class='article-color'>You might have splurged on a tub of the stuff for shinier hair and smoother skin, but slipping it into your diet is a functional fitnesster’s definite must-do: “Coconut oil is an excellent fuel source for workouts. Although it’s saturated fat, the medium-chain fatty acids make it easily absorbable by the small intestine (not requiring the full digestive process),” “This means it provides increased energy faster than any other fat. The fats are converted by the liver into an immediate energy source, much like it would carbohydrates, but it’s sugar and carbohydrate-free! Try a tablespoon of it before your workouts and you’ll be amazed at the energy and endurance it provides.” </p><h3>4 Nuts and Seeds </h3> <p class='article-color'>Get svelte eating like a bird? You betcha. “Nuts and seeds are packed with nutrients and omega-3 fatty acids, which will fuel your recovery after an intense functional fitness WOD. </p><h3>5 Sweet Potatoes</h3> <p class='article-color'>The neverending Instagram stream of this tuberous veggie might have calmed down after the fall, but there’s still plenty of reason to reach for this nutrition powerhouse: “Your body needs functional carbs for a boost of energy. Glycogen is stored in your muscles (and liver) through the digestion of carbs, and your body relies on muscles’ glycogen for energy to carry you through your workout,” explains Kotsopoulos. “One of the best ways to fuel this is with sweet potatoes since they’re complex carbs that are slow- releasing and thus will sustain you through your workout. Sweet potatoes help to balance blood sugar levels providing consistent, steady energy levels. They’re also rich in B6, which combat the physical effects of stress the body goes through during a functional fitness session, and rich in antioxidants Vitamin C and beta-carotene, [which helps to repair] free radical damage caused by working out.” </p><h3>6 Banana and Peanut Butter</h3> <p class='article-color'>Not quite in the mood to head to Smoothie-Ville? It’s okay. This nutrient-dense snack proves a boon for functional fitnessters: “If you do functional fitness, your perfect snack is going to be a blend of carbohydrates, protein and a limited amount of healthy fat,” says Hayim. “The banana here is most important, as it is an excellent source of potassium, which is needed to help the heart and skeletal muscles flex and contract during your workout.” </p><h3>7 Eggs</h3> <p class='article-color'>“Packed with protein, B vitamins, and good fats, eggs are a superfood for functional fitnessters. An egg provides about 7 to 10 grams of protein. Starting the day with a few eggs ups your protein budget daily,” says Dr. Taz. To make breakfast even more protein-rich, try mixing things up and pairing it with one of these Surprising High-Protein Foods for Weight Loss. </p><h3>8 Brown Rice</h3> <p class='article-color'>“Brown rice is better for you than white rice since it is not refined and bleached of nutrients. Also, it is easily digested and less likely to cause bloating and spikes in blood sugar,” says Hayim. Make a big batch at the beginning of the week and use it with different proteins, veggies, and sauces. </p><h3>9 Almond Butter</h3> <p class='article-color'>The possibilities of this tasty spread are endless. “Add a few tablespoons of almond butter into your favorite smoothie or use as a spread or dip. One tablespoon of almond butter has about four grams of protein and eight grams of fat,” says Dr. Taz. We all know protein is king for ripped ‘n’ fit folks, but don’t forget the key role fat plays: “Fat is important for functional fitness as well since it is another great source of long-lasting energy.” </p><h3>10 Oatmeal</h3> <p class='article-color'>Oatmeal is a stellar breakfast companion, is trendy when dressed up as overnight oats, and is versatile enough to be used as 15 Ways to Lose Weight with Oatmeal. For functional fitnessters, though, it’s an incredible must-have, too: “Oatmeal is a great pre or post-workout food as it delivers carbohydrates to the body efficiently without unnecessary sugars,” shares Hayim. “It also happens to be excellent for muscle recovery.” </p><h3>11 Low-Fat Chocolate Milk</h3> <p class='article-color'>We saved the best for last, now didn’t we? “Studies suggest that chocolate milk, which is high in carbohydrates and protein, may be considered an effective drink for recovery from exhausting glycogen-depleting exercise, like functional fitness,” explains Hayim. Just remember to wipe off that ‘stache </p></div>",
  "url": ""
  },
  {
  "id": 7,
  "date": "Posted on 20 October 2020",
  "type": "Nutrition",
  "title": "5 Nutrition Tips for functional fitness Athletes",
  "subtitle": "How can you ensure that all your hardwork at the box is giving you optimal results?",
  "cover": "https://images.unsplash.com/photo-1535914254981-b5012eebbd15?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=300&q=80",
  "paragraph": "<div class='mt-2'> <p class='article-color'>How can you ensure that all your hard work at the box is giving you optimal results?functional fitness athletes push themselves as hard as they can during WODs, but many lack the knowledge about proper nutrition pre and post-workout. Most cross-fitters don’t realize that nutrition, hydration, and recovery are what enables athletes to have optimal performance. </p><h3>1. Hydration: </h3> <p class='article-color'>Our bodies are primarily made up of water (70% of muscle is water). During WODs, we sweat a lot, it is extremely important to hydrate BEFORE, DURING, and AFTER workouts. Make sure you bring a water bottle with you and DRINK it.2. Recommended amounts:3. 15-20 ounces of water prior to working out4. 10 ounces of water every 20 minutes during the workout5. Additional 8-15 ounces post-workout </p><h3>2. Breakfast: </h3> <p class='article-color'>Frequently, I hear from the “dawn patrol” athletes that they skip breakfast because it’s too early to eat. Here’s the issue, your body is in a fasting state from sleeping the night before and your glycogen stores are the lowest in the morning. Unfortunately, when you work out on an empty stomach your body breaks down MUSCLE before fat. High-intensity exercise on an empty stomach does NOT help you burn fat! </p><h3>2. Tip: </h3> <p class='article-color'>Have a source of carbohydrate and protein for breakfast, with a large glass of water! </p><h3>3. Post-workout:</h3> <p class='article-color'>The majority of cross-fitters would be surprised to find out that protein is NOT the most important macronutrient to consume immediately after a workout. Replacing depleted carbohydrates stored in your body is the most important thing to do directly after working out. You have a 30-minute window to eat carbohydrates after workouts to ensure optimal replacement of your glycogen stores. This is important because it will help with faster recovery and improve your performance the next time you workout! Don’t get me wrong, protein is important too, but you have about an hour to consume protein after a workout. </p><h3>3. Tip:</h3> <p class='article-color'>Bring a banana with you after your workout to eat on the way home. If you aren’t able to eat within an hour, a supplement shake would be a good option (ideally containing about 30 grams of carbohydrates and 30 grams of protein). </p><h3>4. Are you a meathead?</h3> <p class='article-color'>Most people think the more protein the better. When trying to build muscle, your protein requirements are higher than an average individual but don’t take that to the extreme. The problem with excessive amounts of protein is that you are putting a lot of stress on your kidneys, which causes damage over an extended period of time. The average person can only absorb about 30 grams at a time, which is why it is recommended to consume about 4 ounces of protein per sitting. Protein recommendations are based on weight, and your health goals (ie gain muscle, lose weight). </p><h3>5. Vitamins on vitamins on vitamins:</h3> <p class='article-color'>Do you really need to be taking all these supplements? I ALWAYS tell my clients, the whole food is best. The supplement industry isn’t regulated or tested, and many contain metals. Many supplements are very hard for your body to digest because they contain binders and fillers. If you follow a balanced diet with adequate amounts of colorful fruits and veggies, you will be getting the vitamins and minerals you need. There are very few supplements that I actually would recommend. OMEGA 3 supplements are something that I recommend to all of my clients. Omega 3s have an abundance of health benefits including improvement of heart health, decreasing inflammation, decrease recovery time, and decrease your body’s reaction to stress (workouts). </p></div>",
  "url": ""
  },
  {
  "id": 8,
  "date": "Posted on 20 October 2020",
  "type": "Lifestyle",
  "title": "Six tips to boost your functional fitness knowladge",
  "subtitle": "Warm up is a necessary part of any workout.",
  "cover": "https://images.unsplash.com/photo-1534258936925-c58bed479fcb?ixlib=rb-1.2.1&auto=format&fit=crop&w=300&q=80",
  "paragraph": "<div class='mt-2'> <h3>Adequately warm up:</h3> <p class='article-color'> Warm-up is a necessary part of any workout. You cannot begin working out without warming up your body. This helps you to prepare your muscles for the movements during a workout. functional fitness – being more intense than regular forms of workout – requires more warming up since the muscles have to get ready for a series of vigorous moves. This will help prevent muscle injury. It’s best to reach your functional fitness class well beforehand and spend extra time warming up. </p><h3>Consult a physician first:</h3> <p class='article-color'> As already mentioned above, functional fitness is an accepted form of workout that can be performed by anyone, with very few exceptions. However, people with a history of heart disease are usually advised to avoid intense movements. If you still think you can perform well, consult a physician to know what’s best for you. </p><h3>Be regular:</h3> <p class='article-color'> The standard timetable for functional fitness states that it should be performed three times a week, with one rest day in between. But this is a bit much for a newbie or a beginner. You will need to make a slow start to help you work out according to your muscle needs and capacity. The muscles need enough time to recover as well. Slowly building up your intensity will ensure you don’t feel tired easily and will help you cope with the further movements involved in the process. </p><h3>Master the techniques:</h3> <p class='article-color'> Unlike regular workouts, you can’t simply increase weights in order to demonstrate an ability to do better. functional fitness focuses on techniques rather than the weight that is lifted. Don’t concentrate on the weights that you use, but make sure you master the techniques that you are making use of. Most importantly, a coach is the best person to advise you on the next stage of your workout progression. </p><h3>Muscle recovery:</h3> <p class='article-color'> Like warming up, this step is also necessary. functional fitness makes you perform intense workouts that may cause your muscles to work more intensively. You need to give your muscles enough time to recover. Muscles usually take anything between 24 hours to 48 hours to recover naturally. But if you want them to recover sooner, a few stretching exercises after a functional fitness session will help you loosen up your muscles and reduce the amount of pain that you may experience later. </p><h3>A healthy diet:</h3> <p class='article-color'> We all know that diet plays an important role in everything we do. You need enough strength and motivation to perform the exercises included in your functional fitness session. Thus, a nutrient-rich diet will help in strengthening your mind and muscles too. There are also a variety of natural workout supplements available that can assist the other foods that we eat. </p></div>",
  "url": ""
  }
]